<template>
  <div id="work" class="work">
    <div class="work__container l-container">
      <div class="work__top">
        <h2 class="work__title">Як ми працюємо</h2>
      </div>
      <div class="work__items">
        <div class="work__item">
          <svg class="work__item-img" aria-hidden="true" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 32 32">
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M26.4 10.875v10.9c0 0.6-0.5 1.1-1.1 1.1 0 0 0 0 0 0h-18.5c-0.6 0-1.1-0.5-1.1-1.1v-10.9c0-0.6 0.5-1.1 1.1-1.1h6.45c-0.025 0.25-0.025 0.475-0.025 0.725 0 0.55 0.050 1.1 0.15 1.625 0.1 0.475 0.225 0.95 0.4 1.4h4.525c0.175-0.45 0.3-0.9 0.4-1.375 0.1-0.55 0.15-1.1 0.15-1.625 0-0.25 0-0.5-0.025-0.725h6.45c0.625-0.025 1.1 0.475 1.125 1.075 0 0 0 0 0 0z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M18.85 9.775c-0.2-2.275-1.275-4.225-2.8-5.3-1.525 1.1-2.6 3.050-2.8 5.3-0.025 0.25-0.025 0.475-0.025 0.725 0 0.55 0.050 1.1 0.15 1.625 0.1 0.475 0.225 0.95 0.4 1.4h4.525c0.175-0.45 0.3-0.9 0.4-1.375 0.1-0.55 0.15-1.1 0.15-1.625 0.025-0.25 0.025-0.5 0-0.75z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M16.825 9.775c-0.175 0.425-0.65 0.625-1.075 0.45-0.2-0.075-0.375-0.25-0.45-0.45-0.175-0.3-0.25-0.625-0.25-0.975 0-0.825 0.45-1.475 1-1.475s1 0.675 1 1.475c0.025 0.35-0.075 0.7-0.225 0.975z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M18.325 13.525c-0.15 0.4-0.325 0.775-0.55 1.125h-3.45c-0.225-0.35-0.4-0.725-0.55-1.125h4.55z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M14.325 14.65l-1.675 1.2-0.75-1.975 1.5-1.725c0.1 0.475 0.225 0.95 0.4 1.4 0.125 0.375 0.325 0.75 0.525 1.1z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M20.2 13.875l-0.75 1.975-1.7-1.2c0.225-0.35 0.4-0.725 0.55-1.125 0.175-0.45 0.3-0.9 0.4-1.375l1.5 1.725z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M17.075 8.825c0 0.35-0.075 0.675-0.25 0.975-0.175 0.425-0.65 0.625-1.075 0.45-0.2-0.075-0.375-0.25-0.45-0.45-0.175-0.3-0.25-0.625-0.25-0.975 0-0.825 0.45-1.475 1-1.475s1.025 0.65 1.025 1.475z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M5.7 20.725v1.225c0 0.525 0.5 0.95 1.1 0.95h18.475c0.6 0 1.1-0.425 1.1-0.95v-1.225h-20.675z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M14.325 22.875h3.45v2.975h-3.45v-2.975z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M14.325 22.875h3.45v1.2h-3.45v-1.2z"></path>
            <path fill="#269447" style="fill: var(--color, #269447)" d="M15.95 16.3c0.25 0 0.45 0.2 0.45 0.45v2.2c0 0.25-0.2 0.45-0.45 0.45s-0.45-0.2-0.45-0.45v-2.2c0.025-0.25 0.225-0.45 0.45-0.45 0 0 0 0 0 0zM13.8 17.1v0.9c0 0.25 0.2 0.45 0.45 0.45s0.45-0.2 0.45-0.45v-0.9c0-0.25-0.2-0.45-0.45-0.45s-0.45 0.2-0.45 0.45zM17.25 17.1v0.9c0 0.25 0.2 0.45 0.45 0.45s0.45-0.2 0.45-0.45v-0.9c0-0.25-0.2-0.45-0.45-0.45s-0.45 0.2-0.45 0.45zM21.975 10.225h0.35c0.25 0 0.45-0.2 0.45-0.45s-0.2-0.45-0.45-0.45h-0.35c-0.25 0-0.45 0.2-0.45 0.45s0.2 0.45 0.45 0.45v0zM26.825 21.925c-0.025 0.725-0.6 1.375-1.525 1.375h-7.075v2.1h1.5c0.25 0 0.45 0.2 0.45 0.45s-0.2 0.45-0.45 0.45h-7.35c-0.25 0-0.45-0.2-0.45-0.45s0.2-0.45 0.45-0.45h1.5v-2.1h-7.075c-0.9 0-1.5-0.625-1.525-1.375 0-2.125 0-5.975 0-11.050 0-0.85 0.7-1.525 1.525-1.525h6.050c0.275-2.175 1.35-4.1 2.925-5.225 0.15-0.1 0.35-0.1 0.5 0 1.6 1.125 2.675 3.050 2.975 5.225h1.050c0.25 0 0.45 0.2 0.45 0.45s-0.2 0.45-0.45 0.45h-0.975c0.025 0.625-0.025 1.225-0.125 1.8l1.35 1.575c0.1 0.125 0.125 0.3 0.075 0.45l-0.75 1.975c-0.1 0.275-0.425 0.375-0.65 0.2l-1.575-1.125h-3.175l-1.575 1.125c-0.225 0.15-0.55 0.075-0.675-0.2l-0.75-1.975c-0.050-0.15-0.025-0.325 0.075-0.45l1.35-1.575c-0.1-0.575-0.15-1.2-0.125-1.8h-5.975c-0.375 0-0.65 0.3-0.65 0.65v4.1c1.125 0.2 1.975 1.075 2.15 2.175 1.3 0.175 2.3 1.3 2.3 2.6 0 0.25-0.2 0.45-0.45 0.45s-0.45-0.2-0.45-0.45c0-0.975-0.8-1.75-1.75-1.75-0.3 0-0.6 0.075-0.875 0.225-0.2 0.125-0.475 0.050-0.6-0.15s-0.050-0.475 0.15-0.6v0c0.25-0.15 0.5-0.225 0.775-0.3-0.15-0.65-0.65-1.15-1.275-1.325v4.4h19.8v-5.025c-0.75 0.175-1.325 0.775-1.475 1.525 0.2 0.050 0.375 0.1 0.55 0.175 0.225 0.1 0.325 0.35 0.225 0.575s-0.35 0.325-0.575 0.225c-0.25-0.1-0.525-0.175-0.8-0.175-1.075 0-1.95 0.875-1.95 1.95 0 0.25-0.2 0.45-0.45 0.45s-0.45-0.2-0.45-0.45c0-1.45 1.1-2.675 2.55-2.8 0.175-1.225 1.125-2.175 2.35-2.375v-3.5c0-0.375-0.3-0.65-0.65-0.65h-1.425c-0.25 0-0.45-0.2-0.45-0.45s0.2-0.45 0.45-0.45h1.425c0.85 0 1.525 0.7 1.525 1.525 0.050 2.65 0.050 8.575 0.050 11.1zM13.75 14.525c-0.3-0.575-0.425-0.975-0.575-1.4 0-0.025-0.025-0.050-0.025-0.050l-0.775 0.9 0.45 1.2 0.925-0.65zM17.65 13.975h-3.2c0.050 0.075 0.1 0.175 0.125 0.25h2.925c0.050-0.1 0.1-0.175 0.15-0.25zM19.7 13.95l-0.75-0.875c-0.15 0.5-0.4 1.075-0.6 1.45l0.9 0.625 0.45-1.2zM13.7 9.825c-0.1 1.025 0.025 2.125 0.4 3.275h3.925c0.35-1.050 0.5-1.95 0.4-3.275-0.175-1.95-1.050-3.725-2.35-4.8-1.35 1.075-2.225 2.85-2.375 4.8zM17.35 23.325h-2.6v2.1h2.575v-2.1zM25.95 21.15h-19.8v0.625c0 0.375 0.3 0.65 0.65 0.65h18.475c0.35 0 0.65-0.3 0.65-0.65l0.025-0.625zM14.525 8.825c0-0.975 0.55-1.95 1.5-1.9 1 0.025 1.5 0.95 1.5 1.9s-0.525 1.925-1.55 1.925c-1-0.050-1.475-1.075-1.45-1.925zM15.475 8.825c0 0.375 0.15 0.925 0.525 1.025 0.375-0.1 0.525-0.65 0.525-1.025 0-0.55-0.275-0.975-0.525-1.025-0.25 0.025-0.525 0.45-0.525 1.025zM7.625 11.1c-0.225 0-0.4 0.175-0.4 0.4s0.175 0.4 0.4 0.4c0.225 0 0.4-0.175 0.4-0.4s-0.175-0.4-0.4-0.4v0zM8.825 11.1c-0.225 0-0.4 0.175-0.4 0.4s0.175 0.4 0.4 0.4c0.225 0 0.4-0.175 0.4-0.4s-0.175-0.4-0.4-0.4c0 0 0 0 0 0zM10.025 11.1c-0.225 0-0.4 0.175-0.4 0.4s0.175 0.4 0.4 0.4c0.225 0 0.4-0.175 0.4-0.4s-0.175-0.4-0.4-0.4z"></path>
          </svg>
          <div class="work__item-title">Для малого та середнього бізнесу</div>
          <div class="work__item-text">Універсальний постачальник завжди поруч</div>
          <div class="work__item-text">
            Швидко доставимо всю необхідну продукцію на вашу локацію за попередньо погодженим
            графіком чи за вашим індивідуальним замовленням
          </div>
        </div>
        <div class="work__item">
          <svg class="work__item-img" aria-hidden="true" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 32 32">
            <path fill="#269447" style="fill: var(--color, #269447)" d="M23.087 15.22h-6.65v-2.422c0-0.242-0.196-0.438-0.438-0.438s-0.438 0.196-0.438 0.438v0 2.422h-6.65c-0.828 0-1.5 0.672-1.5 1.5v0 1.32c0 0.242 0.196 0.438 0.438 0.438s0.438-0.196 0.438-0.438v0-1.321c0-0.345 0.28-0.625 0.625-0.625v0h6.65v4.353c0 0.242 0.196 0.438 0.438 0.438s0.438-0.196 0.438-0.438v0-4.352h6.65c0.345 0 0.625 0.28 0.625 0.625v0 1.32c0 0.242 0.196 0.438 0.438 0.438s0.438-0.196 0.438-0.438v0-1.321c-0-0.828-0.672-1.499-1.5-1.499-0 0-0 0-0 0v0z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M12.774 7.501h6.453c0.609 0 1.102 0.494 1.102 1.103v3.092c0 0.609-0.494 1.103-1.102 1.103h-6.453c-0.609 0-1.103-0.494-1.103-1.102v-3.092c0-0.609 0.494-1.103 1.102-1.103z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M6.841 18.242h2.020c0.609 0 1.103 0.494 1.103 1.102v-0c0 0.609-0.494 1.102-1.102 1.102h-2.020c-0.609 0-1.103-0.494-1.103-1.102v0c0-0.609 0.494-1.102 1.103-1.102z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M14.99 20.447h2.020c0.609 0 1.102 0.494 1.102 1.102v-0c0 0.609-0.494 1.102-1.102 1.102h-2.020c-0.609 0-1.102-0.494-1.102-1.102v0c0-0.609 0.494-1.102 1.102-1.102z"></path>
            <path fill="#ffffff" style="fill: var(--color7, #ffffff)" d="M23.139 18.242h2.020c0.609 0 1.102 0.494 1.102 1.102v-0c0 0.609-0.494 1.102-1.102 1.102h-2.020c-0.609 0-1.102-0.494-1.102-1.102v0c0-0.609 0.494-1.102 1.102-1.102z"></path>
            <path fill="#269447" style="fill: var(--color, #269447)" d="M15 7.939h0.344c0.242 0 0.438-0.196 0.438-0.438s-0.196-0.438-0.438-0.438v0h-0.344c-0.242 0-0.438 0.196-0.438 0.438s0.196 0.438 0.438 0.438v0z"></path>
            <path fill="#269447" style="fill: var(--color, #269447)" d="M25.159 17.805h-0.573v-1.086c0-0.828-0.672-1.5-1.5-1.5v0h-6.649v-1.984h2.789c0.85-0.001 1.539-0.69 1.54-1.54v-3.092c-0.001-0.85-0.69-1.539-1.54-1.54h-2.508c-0.242 0-0.438 0.196-0.438 0.438s0.196 0.438 0.438 0.438v0h2.508c0.367 0 0.664 0.298 0.665 0.665v3.092c-0 0.367-0.298 0.664-0.665 0.665h-6.453c-0.367-0-0.664-0.298-0.665-0.665v-3.092c0-0.367 0.298-0.664 0.665-0.665h0.664c0.242 0 0.438-0.196 0.438-0.438s-0.196-0.438-0.438-0.438v0h-0.664c-0.85 0.001-1.539 0.69-1.54 1.54v3.092c0.001 0.85 0.69 1.539 1.54 1.54h2.789v1.985h-6.65c-0.828 0-1.5 0.672-1.5 1.5v0 1.085h-0.572c-0.85 0-1.54 0.689-1.54 1.54s0.689 1.54 1.54 1.54h2.021c0.85 0 1.54-0.689 1.54-1.54s-0.689-1.54-1.54-1.54h-0.573v-1.086c0-0.345 0.28-0.625 0.625-0.625v0h6.65v3.916h-0.574c-0.842 0.011-1.52 0.696-1.52 1.54s0.678 1.529 1.519 1.54h2.022c0.006 0 0.013 0 0.020 0 0.851 0 1.54-0.689 1.54-1.54s-0.689-1.54-1.54-1.54c-0.007 0-0.014 0-0.021 0h-0.572v-3.915h6.65c0.345 0 0.625 0.28 0.625 0.625v0 1.085h-0.574c-0.85 0-1.54 0.689-1.54 1.54s0.689 1.54 1.54 1.54h2.021c0.85 0 1.54-0.689 1.54-1.54s-0.689-1.54-1.54-1.54v0zM9.525 19.345c-0 0.367-0.298 0.664-0.665 0.665h-2.019c-0.367 0-0.665-0.298-0.665-0.665s0.298-0.665 0.665-0.665h2.021c0.367 0.001 0.663 0.298 0.664 0.665v0zM17.675 21.55c-0 0.367-0.298 0.664-0.665 0.665h-2.020c-0.362-0.007-0.652-0.302-0.652-0.665s0.29-0.658 0.651-0.665h2.021c0.367 0.001 0.664 0.298 0.665 0.665v0zM25.159 20.010h-2.020c-0.367 0-0.665-0.298-0.665-0.665s0.298-0.665 0.665-0.665h2.021c0.367 0 0.665 0.298 0.665 0.665s-0.298 0.665-0.665 0.665v0z"></path>
          </svg>
          <div class="work__item-title">Для великого бізнесу</div>
          <div class="work__item-text">Системне постачання будь-якого масштабу</div>
          <div class="work__item-text">
            Забезпечимо безперебійне постачання будь-якої складності
            за всіма вашими локаціями/офісами/представництвами
            на території всієї країни
          </div>
        </div>
      </div>
      <div class="work__button-container">
        <a @click="openForm" class="work__button">Спростити закупівлі</a>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "HomeWork",
  methods: {
      openForm() {
          document.querySelector('.b24-web-form-popup-btn-1').click();
      }
  }
};
</script>

<style lang="scss" scoped>
.work {
  padding: 110px 0 110px;
  background: linear-gradient(6.96deg, #e9ecef 5.1%, #ffffff 91.11%);

  &__title {
    position: relative;
    font-weight: 600;
    font-size: 32px;
    color: #222222;
    text-align: center;

    &::before {
      content: "";
      position: absolute;
      top: 5px;
      left: calc(25% - 10px);
      width: 30px;
      height: 30px;
      border-top: 2px solid #737373;
      border-left: 2px solid #737373;
      opacity: 0.5;
      border-radius: 3px 0 0 0;
    }

    &::after {
      content: "";
      position: absolute;
      top: 5px;
      right: calc(25% - 10px);
      width: 30px;
      height: 30px;
      border-top: 2px solid #737373;
      border-right: 2px solid #737373;
      opacity: 0.5;
      border-radius: 0 3px 0 0;
    }
  }

  &__button-container {
    padding-top: 38px;
    display: flex;
    justify-content: center;
  }

  &__button {
    display: block;
    width: fit-content;
    padding: 15px 60px;
    font-weight: 600;
    font-size: 14px;
    color: #ffffff;
    background: #269447;
    border-radius: 8px;
    transition: all ease-in-out 0.3s;
    cursor: pointer;

    &:hover {
      color: #ffffff;
      transform: scale(1.1);
      transition: all ease-in-out 0.3s;
    }
  }

  &__items {
    padding-top: 85px;
    display: flex;
    gap: 50px;
  }

  &__item {
    position: relative;
    padding: 64px 24px 44px;
    background: #ffffff;
    border-radius: 16px;
  }

  &__item-title {
    font-size: 24px;
    font-weight: 700;
    color: #222222;
    text-align: center;
    padding-bottom: 15px;
  }

  &__item-text {
    font-size: 18px;
    font-weight: 700;
    color: #565656;
    text-align: center;
    padding-bottom: 20px;
  }

  &__item-img {
    position: absolute;
    width: 90px;
    height: 90px;
    left: calc(50% - 45px);
    top: -45px;
  }
}
.l-container {
  max-width: 1200px;
  margin: 0 auto;
}

@media (max-width: 1440px) {
  .l-container {
    max-width: none;
    margin: 0;
    padding-right: 120px !important;
    padding-left: 120px !important;
  }
}

@media (max-width: 1350px) {
  .l-container {
    padding-right: 80px !important;
    padding-left: 80px !important;
  }
}

@media (max-width: 1100px) {
  .l-container {
    padding-right: 40px !important;
    padding-left: 40px !important;
  }
}

@media (max-width: 768px) {
  .work {
    padding-top: 60px;
    padding-bottom: 60px;

    &__title {
      font-size: 22px;

      &::after {
        display: none;
      }

      &::before {
        display: none;
      }
    }

    &__button-container {
      padding-top: 30px;
    }

    &__button {
      max-width: 100%;
      min-width: 340px;
      display: flex;
      align-items: center;
      justify-content: center;
      height: 48px;
      padding: 0;
    }

    &__items {
      flex-direction: column;
      gap: 60px;
    }

    &__item {
      padding: 50px 20px 30px;
    }

    &__item-title {
      font-size: 20px;
    }

    &__item-text {
      font-size: 16px;
    }
  }
  .l-container {
    padding-right: 20px !important;
    padding-left: 20px !important;
  }
}

@media (max-width: 576px) {
  .l-container {
    padding-right: 15px !important;
    padding-left: 15px !important;
  }

  .work {
    &__button {
      max-width: 100%;
      min-width: 100%;
    }
  }
}
</style>
